{
    "modelGroups": [
      {
        "modelNames": ["GS D1", "GS 8700D1"],
        "content": [
          {
            "title": {
              "en": "Thread Cutter",
              "cn": "线切刀",
              "ko": "실 절단기"
            },
            "description": {
              "en": "The integrated small knife is useful for manually cutting the thread at the end of the seam.",
              "cn": "集成的小刀对于手动切割缝纫末端的线非常有用。",
              "ko": "통합된 작은 칼은 재봉이 끝날 때 실을 수동으로 자르는 데 유용합니다."
            },
            "image": "feature1D1.png"
          },
          {
            "title": {
              "en": "Integrated Keys",
              "cn": "集成按键",
              "ko": "통합 키"
            },
            "description": {
              "en": "The stitch-to-stitch key is used for precision work. The LED light is integrated into the machine and is adjustable in 3 levels.",
              "cn": "逐针缝纫键用于精密工作。LED灯集成在机器中，并且可以在3个级别调节。",
              "ko": "스티치 투 스티치 키는 정밀 작업에 사용됩니다. LED 조명이 기계에 통합되어 있으며 3단계로 조정할 수 있습니다."
            },
            "image": "feature2D1.png"
          },
          {
            "title": {
              "en": "Integrated Bobbin Winder",
              "cn": "集成梭芯绕线器",
              "ko": "통합 보빈 와인더"
            },
            "description": {
              "en": "Wind the bobbin while you are working, as soon as it is finished you will have the next one ready.",
              "cn": "在工作时绕好梭芯，完成后你将有下一个准备好。",
              "ko": "작업 중에 보빈을 감아두면 완료되면 다음 보빈이 준비됩니다."
            },
            "image": "feature3D1.png"
          },
          {
            "title": {
              "en": "Voltage Protection",
              "cn": "电压保护",
              "ko": "전압 보호"
            },
            "description": {
              "en": "Unstable current? Don't be afraid to damage the machine. The voltage protector will monitor the range of the incoming current.",
              "cn": "电流不稳定？不用担心损坏机器。电压保护器将监控输入电流的范围。",
              "ko": "불안정한 전류? 기계가 손상될까 봐 두려워하지 마세요. 전압 보호 장치가 들어오는 전류의 범위를 모니터링합니다."
            },
            "image": "feature4D1.png"
          },
          {
            "title": {
              "en": "Light/Heavy",
              "cn": "轻/重",
              "ko": "경량/중량"
            },
            "description": {
              "en": "The machine can sew from light to heavy material, adapting to all types of clothing. Also for very heavy work the H model is available.",
              "cn": "机器可以缝制从轻到重的材料，适应各种类型的服装。对于非常重的工作，还提供H型号。",
              "ko": "기계는 가벼운 소재에서 무거운 소재까지 모든 종류의 의류에 적응하여 봉제할 수 있습니다. 매우 무거운 작업을 위해 H 모델도 사용할 수 있습니다."
            },
            "image": "feature5D1.png"
          }
        ]
      },
      
      {
        "modelNames": ["GS D-A3/D-A4"],
        "content": [
          {
            "title": {
              "en": "Digital Footlifter",
              "cn": "数字压脚抬升器",
              "ko": "디지털 프레서 풋 리프터"
            },
            "description": {
              "en": "Foot lifter digitally controlled by a stepper motor. It is possible to adjust up to 13 levels from the panel with one click.",
              "cn": "压脚抬起由步进电机数字控制。可以通过一个按钮从面板调整到13个级别。",
              "ko": "스테퍼 모터로 디지털 제어되는 프레서 풋 리프트. 패널에서 클릭 한 번으로 최대 13단계까지 조정할 수 있습니다."
            },
            "image": "feature1.png"
          },
          {
            "title": {
              "en": "Sewing Pattern",
              "cn": "缝纫图案",
              "ko": "재봉 패턴"
            },
            "description": {
              "en": "You can create beautiful ornamental stitches, thanks to the alternating stitch length and repetitions. They can also be modified according to different needs.",
              "cn": "得益于交替的针脚长度和重复，你可以创建美丽的装饰针迹。它们还可以根据不同的需要进行修改。",
              "ko": "교차되는 스티치 길이와 반복 덕분에 아름다운 장식 스티치를 만들 수 있습니다. 또한 다양한 요구에 따라 수정할 수 있습니다."
            },
            "image": "feature2.png"
          },
          {
            "title": {
              "en": "Silent Bartack",
              "cn": "静音打结",
              "ko": "무소음 바택"
            },
            "description": {
              "en": "Thanks to the structure of the stepper motor for electronic bartack, noise has been drastically reduced: this allows you to work in a quieter and more comfortable work environment.",
              "cn": "得益于步进电机的电子打结结构，噪音已大大降低：这使您可以在更安静、更舒适的工作环境中工作。",
              "ko": "전자 바택을 위한 스테퍼 모터 구조 덕분에 소음이 크게 줄었습니다. 이를 통해 더 조용하고 편안한 작업 환경에서 작업할 수 있습니다."
            },
            "image": "feature3.png"
          },
          {
            "title": {
              "en": "High Precision Overlap",
              "cn": "高精度重叠",
              "ko": "고정밀 중첩"
            },
            "description": {
              "en": "The overlapping of the stitches can be done very precisely in all stitch lengths. Digital bartack function available.",
              "cn": "在所有针脚长度中，针脚的重叠都可以非常精确地完成。提供数字打结功能。",
              "ko": "모든 스티치 길이에서 스티치의 중첩을 매우 정밀하게 수행할 수 있습니다. 디지털 바택 기능 사용 가능."
            },
            "image": "feature4.png"
          }
        ]
      },
      
      {
        "modelNames": ["GS D2"],
        "content": [
          {
            "title": {
              "en": "Automatic Thread Trimmer",
              "cn": "自动剪线器",
              "ko": "자동 실 절단기"
            },
            "description": {
              "en": "At the end of the seam it is possible to activate the automatic thread cutting function which activates a knife with the simple heel counter of the pedal.",
              "cn": "在缝纫结束时，可以通过踩踏板激活自动剪线功能。",
              "ko": "재봉이 끝나면 페달의 힐 카운터를 간단히 눌러 자동 실 절단 기능을 활성화할 수 있습니다."
            },
            "image": "feature1D2.png"
          },
          {
            "title": {
              "en": "Increase Productivity",
              "cn": "提高生产力",
              "ko": "생산성 향상"
            },
            "description": {
              "en": "Thanks to the automatic thread trimmer, efficiency is increased by 30%, thus increasing production capacity and ensuring faster delivery of works.",
              "cn": "由于自动剪线器，效率提高了30%，从而提高了生产能力，确保更快的交货。",
              "ko": "자동 실 절단기 덕분에 효율성이 30% 증가하여 생산 능력이 증가하고 작업의 빠른 납품을 보장합니다."
            },
            "image": "feature2D2.png"
          },
          {
            "title": {
              "en": "Save Thread",
              "cn": "节省线材",
              "ko": "실 절약"
            },
            "description": {
              "en": "On a normal machine without thread trimmer, you have to cut it by hand leaving the tail of the thread about 7cm long. With this machine the remainder is only 4 cm ... almost half!",
              "cn": "在没有剪线器的普通机器上，你必须手动剪线，留下大约7厘米长的线头。使用A2B，剩余的线只有4厘米……几乎减半！",
              "ko": "실 절단기가 없는 일반 기계에서는 약 7cm 길이의 실 꼬리를 남기고 손으로 잘라야 합니다. A2B를 사용하면 나머지는 4cm에 불과합니다... 거의 절반!"
            },
            "image": "feature3D2.png"
          },
          {
            "title": {
              "en": "For Light And Heavy Fabric",
              "cn": "适用于轻薄和厚重面料",
              "ko": "경량 및 중량 직물용"
            },
            "description": {
              "en": "Expand the range of applications: this machine is suitable for various types of fabrics, such as shirts and jeans. The maximum recommended thickness is 10mm.",
              "cn": "扩大应用范围：该机器适用于各种类型的面料，如衬衫和牛仔布。建议的最大厚度为10毫米。",
              "ko": "적용 범위를 확장하십시오: 이 기계는 셔츠 및 청바지와 같은 다양한 유형의 직물에 적합합니다. 권장 최대 두께는 10mm입니다."
            },
            "image": "feature4D2.png"
          },
         
          {
            "title": {
              "en": "LED Light",
              "cn": "LED灯",
              "ko": "LED 조명"
            },
            "description": {
              "en": "3 levels of intensity, offers omnidirectional brightness, reduce eyestrain.",
              "cn": "3级强度，提供全方位亮度，减少眼睛疲劳。",
              "ko": "3단계 강도로 모든 방향에서 밝기를 제공하여 눈의 피로를 줄여줍니다."
            },
            "image": "feature6D2.png"
          },
          {
            "title": {
              "en": "Integrated Bobbin Winder",
              "cn": "集成梭芯绕线器",
              "ko": "통합 보빈 와인더"
            },
            "description": {
              "en": "Wind the bobbin while you are working, as soon as it finishes you will have the next one ready.",
              "cn": "在工作时绕好梭芯，完成后你将有下一个准备好。",
              "ko": "작업 중에 보빈을 감아두면 완료되면 다음 보빈이 준비됩니다."
            },
            "image": "feature7D2.png"
          },
          {
            "title": {
              "en": "Stitch 2 Stitch",
              "cn": "逐针缝纫",
              "ko": "스티치 투 스티치"
            },
            "description": {
              "en": "Thanks to the stitch-to-stitch button located within easy reach on the machine head, even the most difficult stitches can be sewn with precision.",
              "cn": "由于缝纫机头部易于触及的逐针缝纫按钮，即使是最困难的针脚也可以精确缝制。",
              "ko": "기계 헤드에 쉽게 닿을 수 있는 스티치 투 스티치 버튼 덕분에 가장 어려운 스티치도 정밀하게 봉제할 수 있습니다."
            },
            "image": "feature8D2.png"
          }
        ]
      },
      
      {
        "modelNames": ["GS 8420/8450"],
        "content": [
          {
            "title": {
              "en": "Types",
              "cn": "类型",
              "ko": "유형"
            },
            "description": {
              "en": "8420 small hook fixed needles, 8450 small hook disengageable needles",
              "cn": "8420小钩固定针，8450小钩可分离针",
              "ko": "8420 작은 후크 고정 바늘, 8450 작은 후크 분리 바늘"
            },
            "image": "featureA1.png"
          },
          {
            "title": {
              "en": "Auto Cornering",
              "cn": "自动转角",
              "ko": "자동 코너링"
            },
            "description": {
              "en": "After the manual release of the needle, the machine sews the number of stitches set on the display with only 1 needle and stops automatically to allow us to turn the work. It is now possible to resume sewing with the pedal, the machine will automatically lower the second needle after making the preset number of stitches with a single needle.",
              "cn": "手动释放针头后，机器用一根针缝制显示屏上设置的针数，然后自动停止，让我们转动工作。现在可以用脚踏板恢复缝纫，机器将在用一根针缝制预设数量的针后自动降低第二根针。",
              "ko": "수동으로 바늘을 해제한 후, 기계는 디스플레이에 설정된 바늘 수를 단일 바늘로 봉제하고 자동으로 멈춰 작업을 돌릴 수 있게 합니다. 이제 페달로 봉제를 재개할 수 있으며, 기계는 단일 바늘로 설정된 바늘 수를 만든 후 자동으로 두 번째 바늘을 내립니다."
            },
            "image": "featureA2.png"
          },
          {
            "title": {
              "en": "Electro-Pneumatic Release",
              "cn": "电动气动释放",
              "ko": "전자-공압 릴리스"
            },
            "description": {
              "en": "Through this new mechanism for disengaging the needles controlled by solenoid valves, the release of the needle is faster and safer even at high speeds, unlike the mechanical lever.(Optional)",
              "cn": "通过这种由电磁阀控制的新机制，针的释放速度更快，更安全，即使在高速下也是如此，不像机械杠杆那样。(可选)",
              "ko": "솔레노이드 밸브로 제어되는 바늘 분리용 이 새로운 메커니즘을 통해 바늘의 해제는 고속에서도 더 빠르고 안전합니다. 기계적 레버와는 다릅니다. (선택 사항)"
            },
            "image": "featureA3.png"
          },
          {
            "title": {
              "en": "Short Thread",
              "cn": "短线",
              "ko": "짧은 실"
            },
            "description": {
              "en": "The thread trimmer cuts the thread within 3 mm, automatic stitch closure to prevent thread loosening, no need to cut the remaining thread, saving time and cost.",
              "cn": "线刀修剪线头在3毫米以内，自动针脚闭合防止线头松动，无需剪断剩余线头，节省时间和成本。",
              "ko": "실 트리머는 3mm 이내에서 실을 자르고, 실이 풀리지 않도록 자동으로 바느질을 마감하여 남은 실을 자를 필요가 없으며 시간과 비용을 절약합니다."
            },
            "image": "featureA4.png"
          },
          {
            "title": {
              "en": "Integrated Footlifter",
              "cn": "集成脚提升器",
              "ko": "통합 풋 리프터"
            },
            "description": {
              "en": "In addition to the thread trimmer, bartack and thread wiper devices, the automatic presser foot lifter is integrated into the body of the machine, making it safe, quiet and beautiful to look at.",
              "cn": "除了线刀、钉扣和擦线装置，自动压脚提升器集成在机器机身内，使其安全、安静且美观。",
              "ko": "실 트리머, 바택 및 실 와이퍼 장치 외에도 자동 프레서 풋 리프터가 기계 본체에 통합되어 안전하고 조용하며 아름다운 외관을 갖추고 있습니다."
            },
            "image": "featureA5.png"
          }
        ]
      },
      {
        "modelNames": ["GS 8420D/8450D1/3/4"],
        "content": [
          {
            "title": {
              "en": "Long-Term Durability and Smooth Operation",
              "cn": "长期耐用性和顺畅操作",
              "ko": "장기 내구성 및 원활한 작동"
            },
            "description": {
              "en": "The advanced sewing machine is engineered with several key features essential for optimal performance. The stepper dual drive system ensures unparalleled precision in needle and fabric movement, allowing for exact stitching and enhanced control. The integrated oil tank provides essential lubrication, significantly reducing wear and tear on moving parts and ensuring long-term durability and smooth operation. The sealing mechanism is designed to prevent any leaks, maintaining the machine’s internal integrity and preventing oil spills.",
              "cn": "高级缝纫机采用多个关键功能设计，确保最佳性能。步进双驱动系统确保针和面料移动的无与伦比的精度，允许精确缝合和增强控制。集成油箱提供必要的润滑，大大减少运动部件的磨损，确保长期耐用和顺畅操作。密封机制旨在防止任何泄漏，保持机器内部完整性并防止漏油。",
              "ko": "고급 재봉틀은 최적의 성능을 위해 필수적인 여러 가지 주요 기능으로 설계되었습니다. 스테퍼 듀얼 드라이브 시스템은 바늘과 원단 움직임의 탁월한 정밀성을 보장하여 정확한 바느질과 향상된 제어를 가능하게 합니다. 통합 오일 탱크는 필수적인 윤활을 제공하여 움직이는 부품의 마모를 크게 줄이고 장기적인 내구성과 원활한 작동을 보장합니다. 밀봉 메커니즘은 누출을 방지하도록 설계되어 기계의 내부 무결성을 유지하고 오일 유출을 방지합니다."
            },
            "image": "featureB1.png"
          },
          {
            "title": {
              "en": "Straight knife system",
              "cn": "直刀系统",
              "ko": "스트레이트 나이프 시스템"
            },
            "description": {
              "en": "Straight knife thread trimming mechanism, stable thread trimming.",
              "cn": "直刀线修剪机构，稳定的线修剪。",
              "ko": "스트레이트 나이프 실 트리밍 메커니즘, 안정적인 실 트리밍."
            },
            "image": "featureB2.png"
          }
        ]
      },
      {
        "modelNames": ["GS D6","GS D7/D7X","GS 5200D"],
        "content": [
          {
            "title": {
              "en": "Needle Feed",
              "cn": "针送料",
              "ko": "바늘 피드"
            },
            "description": {
              "en": "Compared to normal feed with only the movement of the feed dog, this system allows you to drag light / medium fabrics such as sheets and curtains thanks to the needle bar that moves together with the material.",
              "cn": "与仅通过送布牙移动的正常送料相比，该系统允许您拖动轻型/中型面料，如床单和窗帘，因为针杆与材料一起移动。",
              "ko": "피드 도그의 움직임만 있는 일반적인 피드에 비해, 이 시스템은 바늘 바가 재료와 함께 움직이기 때문에 시트 및 커튼과 같은 가벼운/중간 직물을 끌 수 있게 해줍니다."
            },
            "image": "featureC1.png"
          },
          {
            "title": {
              "en": "Silent Bartack",
              "cn": "静音打结",
              "ko": "조용한 바텍"
            },
            "description": {
              "en": "Thanks to the structure of the stepper motor for electronic bartack, noise has been drastically reduced this allows you to work in a quieter and more comfortable work environment.",
              "cn": "由于电子打结用步进电机的结构，噪音大大降低，使您能够在更安静、更舒适的工作环境中工作。",
              "ko": "전자 바텍용 스테퍼 모터의 구조 덕분에 소음이 크게 줄어들어 더 조용하고 편안한 작업 환경에서 작업할 수 있습니다."
            },
            "image": "featureC2.png"
          },
         
          {
            "title": {
              "en": "Sealed Oil Pan",
              "cn": "密封油盘",
              "ko": "밀폐된 오일 팬"
            },
            "description": {
              "en": "The Oil pan is sealed, prevents the entry of dust, keeping the machine clean and resistant, ensuring perfect lubrication. OIL INDICATOR allows easy control of the oil level by constantly monitoring it.",
              "cn": "油盘密封，防止灰尘进入，保持机器清洁和耐用，确保完美润滑。油指示器通过持续监控油位，使您能够轻松控制油位。",
              "ko": "오일 팬은 밀폐되어 있어 먼지가 들어가지 않도록 하여 기계를 깨끗하고 내구성 있게 유지하며 완벽한 윤활을 보장합니다. 오일 인디케이터는 오일 레벨을 지속적으로 모니터링하여 쉽게 제어할 수 있습니다."
            },
            "image": "featureC4.png"
          },
          {
            "title": {
              "en": "Semi-Dry",
              "cn": "半干",
              "ko": "세미 드라이"
            },
            "description": {
              "en": "Dry head: No oil, the head is lubricated with grease. It is also equipped with a black needle bar in DLC (Diamond Like Carbon), it is the treatment that is used to give high hardness and resistance to wear.",
              "cn": "干头：无油，头部润滑脂润滑。它还配备了DLC（类金刚石碳）黑色针杆，这是一种用于提供高硬度和耐磨性的处理。",
              "ko": "건조 헤드: 오일이 없으며 헤드는 그리스로 윤활됩니다. 또한 DLC(다이아몬드 유사 탄소)로 된 검은색 바늘 막대가 장착되어 있어 높은 경도와 내마모성을 제공합니다."
            },
            "image": "featureC5.png"
          },
          {
            "title": {
              "en": "Topstitching Trousers Waistband (PK-F)",
              "cn": "顶缝裤腰带（PK-F）",
              "ko": "상단 스티치 바지 허리띠 (PK-F)"
            },
            "description": {
              "en": "Topstitching trousers waistband for blind seams with integrated puller close to presser foot controlled by panel, double compensated foot with spring-loaded bow and column stand.",
              "cn": "用于盲缝裤腰带的顶缝，带有靠近压脚的集成拉器，由面板控制，带有弹簧加载弓和柱支架的双补偿脚。",
              "ko": "패널로 제어되는 프레서 풋 가까이에 통합 풀러가 있는 블라인드 솔기용 바지 허리띠 상단 스티치, 스프링 장착 활 및 기둥 스탠드가 있는 이중 보상 발."
            },
            "image": "featureC6.png"
          },
          {
            "title": {
              "en": "Sewing Motifs",
              "cn": "缝纫图案",
              "ko": "재봉 모티브"
            },
            "description": {
              "en": "Can create stitches, to the alternating stitch length. They can be different.",
              "cn": "可以创建针迹，交替针长。他们可能会有所不同。",
              "ko": "스티치를 생성할 수 있으며, 교대로 스티치 길이를 설정할 수 있습니다. 다를 수 있습니다."
            },
            "image": "featureC7.png"
          }
        ]
      },
      {
        "modelNames": ["GS S6/UT/EUT", "GS S3"],
        "content": [
          {
            "title": {
              "en": "Automatic Chaincut",
              "cn": "自动切链",
              "ko": "자동 체인 컷"
            },
            "description": {
              "en": "Thanks to the photocells, the electronic cutter is automatic at the start and/or end of the seam.",
              "cn": "多亏了光电池，电子切割机在接缝开始和/或结束时自动化。",
              "ko": "광전지를 사용하여 전자 커터가 솔기 시작 및/또는 끝에서 자동으로 작동합니다."
            },
            "image": "featureD1.png"
          },
          {
            "title": {
              "en": "Automatic Footlifter",
              "cn": "自动脚提升器",
              "ko": "자동 풋 리프터"
            },
            "description": {
              "en": "Also, the presser foot lifter is controlled electronically and automatically thanks to the photocells which lift it before and/or after sewing.",
              "cn": "同样，压脚提升器通过光电池电子自动控制，在缝纫前和/或缝纫后提升。",
              "ko": "또한 프레서 풋 리프터는 봉제 전 및/또는 봉제 후에 이를 들어 올리는 광전지 덕분에 전자적으로 자동 제어됩니다."
            },
            "image": "featureD2.png"
          },
          {
            "title": {
              "en": "Acceleration And Deceleration",
              "cn": "加速和减速",
              "ko": "가속 및 감속"
            },
            "description": {
              "en": "Response increased by 14.3%: acceleration from 0 to 5500rpm in 100ms; deceleration from 5500rpm to 0 in 180ms.",
              "cn": "响应速度提高14.3%：100毫秒内从0加速到5500rpm；180毫秒内从5500rpm减速到0。",
              "ko": "응답이 14.3% 증가: 100ms 내에 0에서 5500rpm으로 가속; 180ms 내에 5500rpm에서 0으로 감속."
            },
            "image": "featureD3.png"
          },
          {
            "title": {
              "en": "Three Sewing Modes",
              "cn": "三种缝纫模式",
              "ko": "세 가지 봉제 모드"
            },
            "description": {
              "en": "Manual mode with full use of the pedal, semi-automatic with the use of the pedal for sewing but cutting and presser foot lift are automatic thanks to the photocells and finally automatic where the machine works only with the photocells.",
              "cn": "手动模式完全使用踏板，半自动使用踏板进行缝纫，但剪线和压脚提升是自动的，这要归功于光电池，最后全自动模式下机器仅通过光电池工作。",
              "ko": "페달을 완전히 사용하는 수동 모드, 페달을 사용하여 봉제하는 반자동 모드이지만 커팅 및 프레서 풋 리프트는 광전지 덕분에 자동이며, 마지막으로 기계가 광전지로만 작동하는 자동 모드입니다."
            },
            "image": "featureD4.png"
          },
          {
            "title": {
              "en": "Wide Adaptability",
              "cn": "广泛的适应性",
              "ko": "넓은 적응성"
            },
            "description": {
              "en": "The double feed of the feed dog facilitates the processing of different types of material.",
              "cn": "送布牙的双重送料便于处理不同类型的材料。",
              "ko": "피드 도그의 이중 피드는 다양한 종류의 재료 처리를 용이하게 합니다."
            },
            "image": "featureD5.png"
          },
          {
            "title": {
              "en": "Mesh Fabric Mode",
              "cn": "网布模式",
              "ko": "메시 패브릭 모드"
            },
            "description": {
              "en": "Avoid starting the seam when the photocells are covered by very thin or transparent material such as tulle and organza, guaranteeing a perfect seam.",
              "cn": "当光电池被非常薄或透明的材料（如薄纱和欧根纱）覆盖时，避免开始缝合，确保完美缝合。",
              "ko": "광전지가 튤 및 오간자와 같은 매우 얇거나 투명한 재료로 덮여 있을 때 솔기를 시작하지 않아 완벽한 솔기를 보장합니다."
            },
            "image": "featureD6.png"
          }
        ]
      },

      {
        "modelNames": ["GS M7"],
        "content": [
          {
            "title": {
              "en": "Three Modes Of Operation",
              "ko": "작동의 세 가지 모드",
              "cn": "三种操作模式"
            },
            "description": {
              "en": "Select the type of fabric between conventional (B), with irregular cut edges (C) and mesh such as organza and tulle (BS), the machine will adapt the cutting function so as not to spoil the work.",
              "ko": "일반 (B), 불규칙한 절단 가장자리 (C) 및 메쉬와 같은 오간자 및 튤 (BS) 사이에서 원단 유형을 선택하면 기계가 작업을 망치지 않도록 절단 기능을 조정합니다.",
              "cn": "在传统（B）、不规则切割边缘（C）和网格如欧根纱和薄纱（BS）之间选择布料类型，机器将调整切割功能以免破坏工作。"
            },
            "image": "featureE1.png"
          },
          {
            "title": {
              "en": "Direct Drive Motor",
              "ko": "직접 구동 모터",
              "cn": "直接驱动电机"
            },
            "description": {
              "en": "The single shaft structure reduces vibrations by increasing stability, in fact it allows to reach 6000rpm of speed while keeping the noise level below 81dB.",
              "ko": "단일 샤프트 구조는 안정성을 증가시켜 진동을 줄이며, 사실 소음 수준을 81dB 이하로 유지하면서 6000rpm의 속도에 도달할 수 있습니다.",
              "cn": "单轴结构通过增加稳定性来减少振动，实际上它允许达到6000转/分钟的速度，同时将噪音水平保持在81dB以下。"
            },
            "image": "featureE2.png"
          },
          {
            "title": {
              "en": "High Speed",
              "ko": "고속",
              "cn": "高速"
            },
            "description": {
              "en": "Unleash the power of the M7 sewing machine with a phenomenal maximum speed of 6000 RPM, designed for professionals who demand efficiency and precision in every stitch. This advanced machine ensures smooth and consistent performance, allowing you to complete your projects faster without compromising on quality. Whether you’re working on intricate designs or heavy-duty fabrics, the M7 provides the reliability and speed you need to excel in your craft. Upgrade your sewing experience with the cutting-edge technology of the M7.",
              "ko": "매 스티치에서 효율성과 정밀성을 요구하는 전문가를 위해 설계된 최대 속도 6000 RPM의 놀라운 M7 재봉틀의 힘을 발휘하십시오. 이 고급 기계는 매끄럽고 일관된 성능을 보장하여 품질을 손상시키지 않고 프로젝트를 더 빠르게 완료할 수 있도록 합니다. 복잡한 디자인이나 헤비듀티 직물을 작업하든 관계없이 M7은 당신의 기술에서 뛰어날 수 있는 신뢰성과 속도를 제공합니다. M7의 최첨단 기술로 재봉 경험을 업그레이드하십시오.",
              "cn": "以惊人的最高速度6000转/分钟释放M7缝纫机的力量，为每一针都需要效率和精度的专业人士而设计。这台先进的机器确保平稳和一致的性能，使您能够更快地完成项目而不会影响质量。无论您是在处理复杂的设计还是重型面料，M7都能提供您在工艺中脱颖而出的可靠性和速度。使用M7的尖端技术升级您的缝纫体验。"
            },
            "image": "featureE3.png"
          },
          {
            "title": {
              "en": "High Performance",
              "ko": "고성능",
              "cn": "高性能"
            },
            "description": {
              "en": "Step into the future of sewing with the M7, engineered to deliver a maximum speed of 6000 RPM for unparalleled efficiency and precision. Perfect for high-volume production, the M7 ensures your projects are completed swiftly and flawlessly. With its advanced start sewing acceleration, the M7 reaches top speeds in record time, while its brake deceleration technology provides precise control and quick stops, outperforming other machines on the market. Elevate your sewing capabilities with the M7’s superior performance and reliability, making it the ultimate choice for professionals.",
              "ko": "비할 데 없는 효율성과 정밀성을 제공하기 위해 최대 속도 6000 RPM으로 설계된 M7으로 재봉의 미래에 발을 들이십시오. 대량 생산에 완벽한 M7은 프로젝트를 신속하고 완벽하게 완료할 수 있도록 합니다. 고급 시작 바느질 가속 기능을 갖춘 M7은 기록적인 시간 내에 최고 속도에 도달하며, 브레이크 감속 기술은 정밀한 제어와 빠른 정지를 제공하여 시장의 다른 기계를 능가합니다. M7의 뛰어난 성능과 신뢰성으로 재봉 능력을 향상시켜 전문가의 궁극적인 선택이 되도록 합니다.",
              "cn": "迈入缝纫的未来，M7设计了最高速度为6000 RPM，以无与伦比的效率和精度提供服务。非常适合大批量生产，M7确保您的项目快速且完美地完成。凭借其先进的启动缝纫加速功能，M7在创纪录的时间内达到最高速度，而其制动减速技术则提供精确控制和快速停止，性能优于市场上的其他机器。通过M7的卓越性能和可靠性，提升您的缝纫能力，使其成为专业人士的最终选择。"
            },
            "image": "featureE4.png"
          }
        ]
      },

      {
        "modelNames": ["GS 438GT", "GS 430GT-02/03/06"],
        "content": [
          {
            "title": {
              "en": "6x5cm Field",
              "cn": "6x5厘米领域",
              "ko": "6x5cm 필드"
            },
            "description": {
              "en": "This subclass is a small 60x50mm field machine, design your stitching pattern on board machine or from PC. Suitable for elastic bands (GP) or for labels, bags, shoes, decorative stitches (GS).",
              "cn": "此子类是一个小型60x50毫米领域机器，可以在机器上或通过PC设计您的缝纫图案。适用于弹性带（GP）或标签、袋子、鞋子、装饰缝（GS）。",
              "ko": "이 하위 클래스는 작은 60x50mm 필드 기계로, 기계나 PC에서 스티치 패턴을 디자인할 수 있습니다. 탄성 밴드(GP) 또는 라벨, 가방, 신발, 장식 스티치(GS)에 적합합니다."
            },
            "image": "featureF1.png"
          },
          {
            "title": {
              "en": "Reinforcement Seams And Fishing Nets (GN)",
              "cn": "加固缝和渔网 (GN)",
              "ko": "보강 솔기 및 어망 (GN)"
            },
            "description": {
              "en": "Reinforced stitching on high-strength products such as bags and fishing nets can be easily done.",
              "cn": "可以轻松完成在高强度产品如袋子和渔网上的加固缝合。",
              "ko": "가방 및 어망과 같은 고강도 제품에 대한 보강 바느질을 쉽게 할 수 있습니다."
            },
            "image": "featureF2.png"
          },
          {
            "title": {
              "en": "Robot Automatic Loader (GR)",
              "cn": "机器人自动装载机 (GR)",
              "ko": "로봇 자동 로더 (GR)"
            },
            "description": {
              "en": "This machine, with automatic button feeder (robot), increases efficiency by 180% compared to manual work, saving labor and efficiency.",
              "cn": "这台机器配有自动按钮进料器（机器人），与手工工作相比效率提高了180%，节省了劳动力和效率。",
              "ko": "이 기계는 자동 버튼 공급기(로봇)가 장착되어 있어 수작업에 비해 효율이 180% 향상되어 노동력과 효율성을 절약할 수 있습니다."
            },
            "image": "featureF3.png"
          },
          {
            "title": {
              "en": "Chaincutter Wasted Suction",
              "cn": "链式切割废料吸力",
              "ko": "체인커터 낭비 흡입"
            },
            "description": {
              "en": "This sub-class machine allows the fastening of the re-stitching seams of hems and sleeves, by bartacking the chain stitch and cutting the excess chain at the same time.",
              "cn": "这台子类机器可以通过打结链缝和同时切割多余的链条来固定下摆和袖子的重新缝合。",
              "ko": "이 하위 클래스 기계는 체인 스티치를 바택하고 동시에 여분의 체인을 자르므로 밑단과 소매의 재봉 솔기를 고정할 수 있습니다."
            },
            "image": "featureF4.png"
          },
          {
            "title": {
              "en": "Shank Buttons Clamp",
              "cn": "钉柄纽扣夹具",
              "ko": "샹크 버튼 클램프"
            },
            "description": {
              "en": "On this model it is possible to mount the clamp to attach the shank buttons.",
              "cn": "在此型号上可以安装夹具以固定钉柄纽扣。",
              "ko": "이 모델에서는 샹크 버튼을 부착할 수 있는 클램프를 장착할 수 있습니다."
            },
            "image": "featureF5.png"
          }
        ]
      },

          {
            "modelNames": ["GS 927D/927"],
            "content": [
              {
                "title": {
                  "en": "Wide Range Of Applications",
                  "cn": "广泛的应用范围",
                  "ko": "광범위한 응용 프로그램"
                },
                "description": {
                  "en": "This series of feed of the arm machines are used for sewing various products such as denim, shirts and Raincoats.",
                  "cn": "这一系列的臂式送料机用于缝制各种产品，如牛仔布、衬衫和雨衣。",
                  "ko": "이 시리즈의 팔 공급 기계는 데님, 셔츠 및 레인코트와 같은 다양한 제품을 봉제하는 데 사용됩니다."
                },
                "image": "featureG1.png"
              },
              {
                "title": {
                  "en": "Stitch Adjustment",
                  "cn": "针脚调整",
                  "ko": "스티치 조정"
                },
                "description": {
                  "en": "Push button adjustment can flexibly change the stitch length of the machine to suit a variety of needs.",
                  "cn": "按钮调节可以灵活地改变机器的针脚长度，以满足各种需求。",
                  "ko": "버튼 조정으로 다양한 요구에 맞게 기계의 스티치 길이를 유연하게 변경할 수 있습니다."
                },
                "image": "featureG2.png"
              },
              {
                "title": {
                  "en": "Column Stand",
                  "cn": "柱式支架",
                  "ko": "기둥 스탠드"
                },
                "description": {
                  "en": "This type of stand is convenient to use for these processes (it could be optional).",
                  "cn": "这种类型的支架在这些过程中使用方便（它可能是可选的）。",
                  "ko": "이 유형의 스탠드는 이러한 공정에 사용하기 편리합니다(선택 사항일 수 있음)."
                },
                "image": "featureG3.png"
              },
              {
                "title": {
                  "en": "Types Of Pullers",
                  "cn": "拉力器的类型",
                  "ko": "풀러의 종류"
                },
                "description": {
                  "en": "The PL device is a motorized and incorporated puller. The PS device is an external puller, driven by a timing belt.",
                  "cn": "PL装置是电动一体式拉力器。PS装置是由同步带驱动的外部拉力器。",
                  "ko": "PL 장치는 모터가 장착된 일체형 풀러입니다. PS 장치는 타이밍 벨트로 구동되는 외부 풀러입니다."
                },
                "image": "featureG4.png"
              },
              {
                "title": {
                  "en": "Efficient Puller",
                  "cn": "高效拉力器",
                  "ko": "효율적인 풀러"
                },
                "description": {
                  "en": "The oil-lubricated rear puller can be used to make feeding lighter and easier.",
                  "cn": "油润滑的后拉力器可用于使送料更轻松、更容易。",
                  "ko": "오일 윤활 리어 풀러는 피딩을 더 가볍고 쉽게 만들 수 있습니다."
                },
                "image": "featureG5.png"
              }
            ]
          }      
    ]
  }
  